OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16f1578.h
extern __at(0x0DA5) __sfr PWM2PR;

//==============================================================================
//        PWM2PRL Bits

extern __at(0x0DA5) __sfr PWM2PRL;

typedef struct
  {
  unsigned PWM2PRL0             : 1;
  unsigned PWM2PRL1             : 1;
  unsigned PWM2PRL2             : 1;
  unsigned PWM2PRL3             : 1;
  unsigned PWM2PRL4             : 1;
  unsigned PWM2PRL5             : 1;
  unsigned PWM2PRL6             : 1;
  unsigned PWM2PRL7             : 1;
  } __PWM2PRLbits_t;

extern __at(0x0DA5) volatile __PWM2PRLbits_t PWM2PRLbits;

#define _PWM2PRL0               0x01
#define _PWM2PRL1               0x02
#define _PWM2PRL2               0x04
#define _PWM2PRL3               0x08
#define _PWM2PRL4               0x10
#define _PWM2PRL5               0x20
#define _PWM2PRL6               0x40
#define _PWM2PRL7               0x80

//==============================================================================


//==============================================================================
//        PWM2PRH Bits

extern __at(0x0DA6) __sfr PWM2PRH;

typedef struct
  {
  unsigned PWM2PRH0             : 1;
  unsigned PWM2PRH1             : 1;
  unsigned PWM2PRH2             : 1;
  unsigned PWM2PRH3             : 1;
  unsigned PWM2PRH4             : 1;
  unsigned PWM2PRH5             : 1;
  unsigned PWM2PRH6             : 1;
  unsigned PWM2PRH7             : 1;
  } __PWM2PRHbits_t;

extern __at(0x0DA6) volatile __PWM2PRHbits_t PWM2PRHbits;

#define _PWM2PRH0               0x01
#define _PWM2PRH1               0x02
#define _PWM2PRH2               0x04
#define _PWM2PRH3               0x08
#define _PWM2PRH4               0x10
#define _PWM2PRH5               0x20
#define _PWM2PRH6               0x40
#define _PWM2PRH7               0x80

//==============================================================================

extern __at(0x0DA7) __sfr PWM2OF;

//==============================================================================
//        PWM2OFL Bits

extern __at(0x0DA7) __sfr PWM2OFL;

typedef struct
  {
  unsigned PWM2OFL0             : 1;
  unsigned PWM2OFL1             : 1;
  unsigned PWM2OFL2             : 1;
  unsigned PWM2OFL3             : 1;
  unsigned PWM2OFL4             : 1;
  unsigned PWM2OFL5             : 1;
  unsigned PWM2OFL6             : 1;
  unsigned PWM2OFL7             : 1;
  } __PWM2OFLbits_t;

extern __at(0x0DA7) volatile __PWM2OFLbits_t PWM2OFLbits;

#define _PWM2OFL0               0x01
#define _PWM2OFL1               0x02
#define _PWM2OFL2               0x04
#define _PWM2OFL3               0x08
#define _PWM2OFL4               0x10
#define _PWM2OFL5               0x20
#define _PWM2OFL6               0x40
#define _PWM2OFL7               0x80

//==============================================================================


//==============================================================================
//        PWM2OFH Bits

extern __at(0x0DA8) __sfr PWM2OFH;

typedef struct
  {
  unsigned PWM2OFH0             : 1;
  unsigned PWM2OFH1             : 1;
  unsigned PWM2OFH2             : 1;
  unsigned PWM2OFH3             : 1;
  unsigned PWM2OFH4             : 1;
  unsigned PWM2OFH5             : 1;
  unsigned PWM2OFH6             : 1;
  unsigned PWM2OFH7             : 1;
  } __PWM2OFHbits_t;

extern __at(0x0DA8) volatile __PWM2OFHbits_t PWM2OFHbits;

#define _PWM2OFH0               0x01
#define _PWM2OFH1               0x02
#define _PWM2OFH2               0x04
#define _PWM2OFH3               0x08
#define _PWM2OFH4               0x10
#define _PWM2OFH5               0x20
#define _PWM2OFH6               0x40
#define _PWM2OFH7               0x80

//==============================================================================

extern __at(0x0DA9) __sfr PWM2TMR;

//==============================================================================
//        PWM2TMRL Bits

extern __at(0x0DA9) __sfr PWM2TMRL;

typedef struct
  {
  unsigned PWM2TMRL0            : 1;
  unsigned PWM2TMRL1            : 1;
  unsigned PWM2TMRL2            : 1;
  unsigned PWM2TMRL3            : 1;
  unsigned PWM2TMRL4            : 1;
  unsigned PWM2TMRL5            : 1;
  unsigned PWM2TMRL6            : 1;
  unsigned PWM2TMRL7            : 1;
  } __PWM2TMRLbits_t;

extern __at(0x0DA9) volatile __PWM2TMRLbits_t PWM2TMRLbits;

#define _PWM2TMRL0              0x01
#define _PWM2TMRL1              0x02
#define _PWM2TMRL2              0x04
#define _PWM2TMRL3              0x08
#define _PWM2TMRL4              0x10
#define _PWM2TMRL5              0x20
#define _PWM2TMRL6              0x40
#define _PWM2TMRL7              0x80

//==============================================================================


//==============================================================================
//        PWM2TMRH Bits

extern __at(0x0DAA) __sfr PWM2TMRH;

typedef struct
  {
  unsigned PWM2TMRH0            : 1;
  unsigned PWM2TMRH1            : 1;
  unsigned PWM2TMRH2            : 1;
  unsigned PWM2TMRH3            : 1;
  unsigned PWM2TMRH4            : 1;
  unsigned PWM2TMRH5            : 1;
  unsigned PWM2TMRH6            : 1;
  unsigned PWM2TMRH7            : 1;
  } __PWM2TMRHbits_t;

extern __at(0x0DAA) volatile __PWM2TMRHbits_t PWM2TMRHbits;

#define _PWM2TMRH0              0x01
#define _PWM2TMRH1              0x02
#define _PWM2TMRH2              0x04
#define _PWM2TMRH3              0x08
#define _PWM2TMRH4              0x10
#define _PWM2TMRH5              0x20
#define _PWM2TMRH6              0x40
#define _PWM2TMRH7              0x80

//==============================================================================


//==============================================================================
//        PWM2CON Bits

extern __at(0x0DAB) __sfr PWM2CON;

typedef union
  {
  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned PWM2MODE0          : 1;
    unsigned PWM2MODE1          : 1;
    unsigned POL                : 1;
    unsigned OUT                : 1;
    unsigned OE                 : 1;
    unsigned EN                 : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned MODE0              : 1;
    unsigned MODE1              : 1;
    unsigned PWM2POL            : 1;
    unsigned PWM2OUT            : 1;
    unsigned PWM2OE             : 1;
    unsigned PWM2EN             : 1;
    };

  struct
    {
    unsigned                    : 2;
    unsigned MODE               : 2;
    unsigned                    : 4;
    };

  struct
    {
    unsigned                    : 2;
    unsigned PWM2MODE           : 2;
    unsigned                    : 4;
    };
  } __PWM2CONbits_t;

extern __at(0x0DAB) volatile __PWM2CONbits_t PWM2CONbits;

#define _PWM2CON_PWM2MODE0      0x04
#define _PWM2CON_MODE0          0x04
#define _PWM2CON_PWM2MODE1      0x08
#define _PWM2CON_MODE1          0x08
#define _PWM2CON_POL            0x10
#define _PWM2CON_PWM2POL        0x10
#define _PWM2CON_OUT            0x20
#define _PWM2CON_PWM2OUT        0x20
#define _PWM2CON_OE             0x40
#define _PWM2CON_PWM2OE         0x40
#define _PWM2CON_EN             0x80
#define _PWM2CON_PWM2EN         0x80

//==============================================================================


//==============================================================================
//        PWM2INTCON Bits

extern __at(0x0DAC) __sfr PWM2INTCON;

typedef union
  {
  struct
    {
    unsigned PRIE               : 1;
    unsigned DCIE               : 1;
    unsigned PHIE               : 1;
    unsigned OFIE               : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned PWM2PRIE           : 1;
    unsigned PWM2DCIE           : 1;
    unsigned PWM2PHIE           : 1;
    unsigned PWM2OFIE           : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };
  } __PWM2INTCONbits_t;

extern __at(0x0DAC) volatile __PWM2INTCONbits_t PWM2INTCONbits;

#define _PWM2INTCON_PRIE        0x01
#define _PWM2INTCON_PWM2PRIE    0x01
#define _PWM2INTCON_DCIE        0x02
#define _PWM2INTCON_PWM2DCIE    0x02
#define _PWM2INTCON_PHIE        0x04
#define _PWM2INTCON_PWM2PHIE    0x04
#define _PWM2INTCON_OFIE        0x08
#define _PWM2INTCON_PWM2OFIE    0x08

//==============================================================================


//==============================================================================
//        PWM2INTE Bits

extern __at(0x0DAC) __sfr PWM2INTE;

typedef union
  {
  struct
    {
    unsigned PRIE               : 1;
    unsigned DCIE               : 1;
    unsigned PHIE               : 1;
    unsigned OFIE               : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned PWM2PRIE           : 1;
    unsigned PWM2DCIE           : 1;
    unsigned PWM2PHIE           : 1;
    unsigned PWM2OFIE           : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };
  } __PWM2INTEbits_t;

